export default function Home() {
  return (
    <>
      <section>
        <article>
          <h2>Мета порталу</h2>
          <p>Наш веб-портал створений для того, щоб допомогти дітям навчатися легко та цікаво:</p>
          <ul>
            <li>Створення інтерактивних завдань</li>
            <li>Підтримка учнів у процесі навчання</li>
            <li>Розвиток логічного мислення та креативності</li>
          </ul>
        </article>

        <article id="materials">
          <h2>Чого навчаємо</h2>
          <p>Діти мають змогу вивчати різні дисципліни у зручному форматі:</p>

          <table>
            <caption>Список курсів для вивчення</caption>
            <thead>
              <tr>
                <th>№</th>
                <th>Тема</th>
                <th>Вікова група</th>
                <th>Рівень</th>
                <th>Тип завдань</th>
              </tr>
            </thead>
            <tbody>
              <tr><td>1</td><td>Математика</td><td>6–8 років</td><td>Початковий</td><td>Ігрові завдання</td></tr>
              <tr><td>2</td><td>Іноземна мова</td><td>9–12 років</td><td>Середній</td><td>Задачі та вікторини</td></tr>
              <tr><td>3</td><td>Природознавство</td><td>6–10 років</td><td>Початковий</td><td>Мультимедіа</td></tr>
              <tr><td>4</td><td>Інформатика</td><td>10–12 років</td><td>Середній</td><td>Прості програми</td></tr>
              <tr><td>5</td><td>Малювання</td><td>Будь-який</td><td>Будь-який</td><td>Онлайн-галерея</td></tr>
            </tbody>
          </table>
        </article>
      </section>
    </>
  );
}